duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
   // ADC 2
   packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]       = (MASK_2048_CHANID & (SPEKTRUM_CHANNEL_AUX_3 << SPEKTRUM_2048_CHANNEL_SHIFT_BITS))          |
                                                           (0x400 & MASK_2048_SXPOS);

#if 0
   {
      printf("\r\n");
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]);
      printf("[%04x] ", packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]);
   }
#endif

#if 1
   // fades
   while(app_uart_put(packet.fades) != NRF_SUCCESS)
   {
   }
   // system
   while(app_uart_put(packet.system) != NRF_SUCCESS)
   {
   }
   
   // throttle
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // aileron
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // aileron
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // rudder
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // adc 1
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // adc 2
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }

   // adc 3
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6] >> 8) & 0xFF)) != NRF_SUCCESS)
   {
   }
   while(app_uart_put((uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]     ) & 0xFF)) != NRF_SUCCESS)
   {
   }
#endif

#if 0
   {
      printf("\r\n");
      printf("[%02x] [%02x] ",   packet.fades, packet.system);
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_0]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_1]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_2]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_3]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_4]     ) & 0xFF));
      printf("[%02x] [%02x] : ", (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_5]     ) & 0xFF));
      printf("[%02x] [%02x] ",   (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6] >> 8) & 0xFF),
                                 (uint8_t) ((packet.channel[RX_PACKET_SPEKTRUM_CHANNEL_ID_6]     ) & 0xFF));
   }
#endif
   return 0;
}

#elif defined(SERIAL_RX_S_BUS)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_SUMD)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_SUMH)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MODE_B)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MODE_B_BJ01)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_IBUS)

uint8_t send_receiver_command()
{
   return 0;
}

#elif defined(SERIAL_RX_MSP)

uint8_t send_receiver_command()
{
   return 0;
}

#else

uint8_t send_receiver_command()
{
   return 0;
}

#endif

void serial_receiver_timer_handler(void * p_context)
{
   uint32_t cur_tick_count                               = 0;
   uint32_t diff_tick_count                              = 0;
   if (g_prev_tick_count == 0)
   {
      if (app_timer_cnt_get(&g_prev_tick_count) != NRF_SUCCESS)
      {
         printf("Can't get tick count \r\n");
      }
      return;
   }
   if (app_timer_cnt_get(&cur_tick_count) != NRF_SUCCESS)
   {
      printf("Can't get tick count \r\n");
      return;
   }

   if (app_timer_cnt_diff_compute(cur_tick_count, g_prev_tick_count, &diff_tick_count) != NRF_SUCCESS)
   {
      printf("Can't diff tick count \r\n");
      return;
   }
   g_prev_tick_count                                     = cur_tick_count;

   g_update_tick_count                                   += diff_tick_count;
   if (g_update_tick_count > SERIAL_RX_UPDATE_TICK_COUNT)
   {
      g_update_tick_count                                = 0;
      g_update_packet_complete                           = 1;
   }
}

#endif   // SERIAL_RECEIVER

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

