duvallee/drone_transmitter_bt_nrf51822/nrf51_uart_peripheral/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
#if defined(SERIAL_RECEIVER)
        APP_UART_FLOW_CONTROL_DISABLED,
#else
        APP_UART_FLOW_CONTROL_ENABLED,
#endif
        false,
#if defined(SERIAL_RECEIVER)
        SERIAL_RX_BAUDRATE
#else
        UART_BAUDRATE_BAUDRATE_Baud115200
#endif
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
#if !defined(SERIAL_RECEIVER)
    uint8_t start_string[] = START_STRING;
#endif
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
#if defined(SERIAL_RECEIVER)
    APP_TIMER_DEF(serial_rx_timer);
#endif
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

#if !defined(SERIAL_RECEIVER)
    printf("%s", start_string);
#else
    printf("program start \r\n ");
#endif
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

#if defined(SERIAL_RECEIVER)
   if (app_timer_create(&serial_rx_timer, APP_TIMER_MODE_REPEATED, serial_receiver_timer_handler) != NRF_SUCCESS)
   {
      printf("Can't create app timer \r\n");
   }
   if (app_timer_start(serial_rx_timer, APP_TIMER_TICKS(1, APP_TIMER_PRESCALER), NULL) != NRF_SUCCESS)
   {
      printf("Can't start app timer \r\n");
   }
#endif

#if defined(WAVESHARE_BOARD)
   nrf_gpio_cfg_output(WAVESHARE_LED_1);
   nrf_gpio_cfg_output(WAVESHARE_LED_2);
   nrf_gpio_cfg_output(WAVESHARE_LED_3);
   nrf_gpio_cfg_output(WAVESHARE_LED_4);
   nrf_gpio_cfg_output(WAVESHARE_LED_5);

   nrf_gpio_pin_write(WAVESHARE_LED_1, 0);
   nrf_gpio_pin_write(WAVESHARE_LED_2, 0);
   nrf_gpio_pin_write(WAVESHARE_LED_3, 0);
   nrf_gpio_pin_write(WAVESHARE_LED_4, 0);
   nrf_gpio_pin_write(WAVESHARE_LED_5, 0);

#endif

    // Enter main loop.
    for (;;)
    {
#if defined(SERIAL_RECEIVER)
      if (g_bt_rx_command_complete != 0)
      {
         nrf_gpio_pin_write(WAVESHARE_LED_1, 1);
         update_receiver_command();

         g_bt_rx_command_complete                        = 0;
         nrf_gpio_pin_write(WAVESHARE_LED_1, 0);
      }
      if (g_update_packet_complete != 0)
      {
         nrf_gpio_pin_write(WAVESHARE_LED_2, 1);
         send_receiver_command();

         g_update_packet_complete                        = 0;
         nrf_gpio_pin_write(WAVESHARE_LED_2, 0);
      }
#endif
        power_manage();
    }
}


/**
 * @}
 */
